---
kind: method
id: M:Autodesk.Revit.DB.FabricationVersionInfo.Dispose
source: html/4f678881-8f43-66b8-64d8-685e1b8c9499.htm
---
# Autodesk.Revit.DB.FabricationVersionInfo.Dispose Method

Releases all resources used by the FabricationVersionInfo

## Syntax (C#)
```csharp
public void Dispose()
```